In [1]:
import numpy as np
import pandas as pd

In [ ]:
# df.dropna(axis=1,how='all')

In [2]:
df=pd.DataFrame({'col1':[1,2,3,None,5,6.],'col2':[11,23,None,None,100,20.]})
df

   col1   col2
0   1.0   11.0
1   2.0   23.0
2   3.0    NaN
3   NaN    NaN
4   5.0  100.0
5   6.0   20.0

In [9]:
df.fillna({'col1':0})
df

  col1  col2
0    1    11
1    2    23
2    3   NaN
3  NaN   NaN
4    5   100
5  6.0  20.0

In [1]:
import pandas as pd
import numpy as np

In [3]:
df

   col1   col2
0   1.0   11.0
1   2.0   23.0
2   3.0    NaN
3   NaN    NaN
4   5.0  100.0
5   6.0   20.0

In [4]:
df.fillna(method='ffill')

C:\Users\suman\AppData\Local\Temp\ipykernel_26832\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

   col1   col2
0   1.0   11.0
1   2.0   23.0
2   3.0   23.0
3   3.0   23.0
4   5.0  100.0
5   6.0   20.0

In [5]:
df=pd.DataFrame({'col1':[None,2,3,None,5,6.],'col2':[11,23,None,None,100,20.]})
df

   col1   col2
0   NaN   11.0
1   2.0   23.0
2   3.0    NaN
3   NaN    NaN
4   5.0  100.0
5   6.0   20.0

In [7]:
df.fillna(method='ffill')

C:\Users\suman\AppData\Local\Temp\ipykernel_26832\1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

   col1   col2
0   NaN   11.0
1   2.0   23.0
2   3.0   23.0
3   3.0   23.0
4   5.0  100.0
5   6.0   20.0

In [8]:
df.ffill()

   col1   col2
0   NaN   11.0
1   2.0   23.0
2   3.0   23.0
3   3.0   23.0
4   5.0  100.0
5   6.0   20.0

In [9]:
df.fillna(method='bfill')

C:\Users\suman\AppData\Local\Temp\ipykernel_26832\2831856154.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

   col1   col2
0   2.0   11.0
1   2.0   23.0
2   3.0  100.0
3   5.0  100.0
4   5.0  100.0
5   6.0   20.0

In [10]:
df=pd.DataFrame({'col1':[None,2,3,None,5,None],'col2':[11,23,None,None,100,20.]})
df

   col1   col2
0   NaN   11.0
1   2.0   23.0
2   3.0    NaN
3   NaN    NaN
4   5.0  100.0
5   NaN   20.0

In [11]:
df.bfill()

   col1   col2
0   2.0   11.0
1   2.0   23.0
2   3.0  100.0
3   5.0  100.0
4   5.0  100.0
5   NaN   20.0

In [16]:
df['col1']=df['col1'].ffill()
df

   col1   col2
0   NaN   11.0
1   2.0   23.0
2   3.0    NaN
3   3.0    NaN
4   5.0  100.0
5   5.0   20.0

In [17]:
df

   col1   col2
0   NaN   11.0
1   2.0   23.0
2   3.0    NaN
3   3.0    NaN
4   5.0  100.0
5   5.0   20.0

In [19]:
df=pd.DataFrame({'col1':[10,30,10,10,10],'col2':[20,40,20,40,20]})
df

   col1  col2
0    10    20
1    30    40
2    10    20
3    10    40
4    10    20

In [ ]:
df.duplicated() # if complete row duplicate then False, else True // consider 1st one take as original

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [21]:
df.drop_duplicates()

   col1  col2
0    10    20
1    30    40
3    10    40

In [24]:
df.duplicated().sum()

np.int64(2)

In [25]:
df=pd.DataFrame({'col1':[10,30,10,10,10,30,10],'col2':[20,40,20,40,20,40,40]})
df

   col1  col2
0    10    20
1    30    40
2    10    20
3    10    40
4    10    20
5    30    40
6    10    40

In [27]:
df.duplicated()

0    False
1    False
2     True
3    False
4     True
5     True
6     True
dtype: bool

In [33]:
df.duplicated(keep='first')

0    False
1    False
2     True
3    False
4     True
5     True
6     True
dtype: bool

In [34]:
df.duplicated(keep='last')

0     True
1     True
2     True
3     True
4    False
5    False
6    False
dtype: bool

In [37]:
df=pd.DataFrame({'col1':[10,301,10,10,10,30,1000],'col2':[20,40,20,40,20,40,40]})
df

   col1  col2
0    10    20
1   301    40
2    10    20
3    10    40
4    10    20
5    30    40
6  1000    40

In [ ]:
df.duplicated(keep=False)

0     True
1    False
2     True
3    False
4     True
5    False
6    False
dtype: bool

In [40]:
df

   col1  col2
0    10    20
1   301    40
2    10    20
3    10    40
4    10    20
5    30    40
6  1000    40

In [39]:
df.duplicated(subset=['col1'])

0    False
1    False
2     True
3     True
4     True
5    False
6    False
dtype: bool

In [44]:
df=pd.DataFrame({'col0':[10,301,1,5,1,30,1000],'col1':[10,30,10,10,10,30,1000],'col2':[20,40,20,40,20,40,40]})
df

   col0  col1  col2
0    10    10    20
1   301    30    40
2     1    10    20
3     5    10    40
4     1    10    20
5    30    30    40
6  1000  1000    40

In [45]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
6    False
dtype: bool

In [46]:
df.drop_duplicates()

   col0  col1  col2
0    10    10    20
1   301    30    40
2     1    10    20
3     5    10    40
5    30    30    40
6  1000  1000    40

In [47]:
df

   col0  col1  col2
0    10    10    20
1   301    30    40
2     1    10    20
3     5    10    40
4     1    10    20
5    30    30    40
6  1000  1000    40

In [ ]:
#
df.drop_duplicates(inplace=True)
df

   col0  col1  col2
0    10    10    20
1   301    30    40
2     1    10    20
3     5    10    40
5    30    30    40
6  1000  1000    40

In [ ]:
# df.drop_duplicates(subset=[col1,col2,col3,...],keep='first',inplace=False)
# returns dataframe after removing the duplicate records | row.

In [51]:
df=pd.DataFrame({'col1':[10,301,10,10,10,30,1000],'col2':[20,40,20,40,20,40,40]})
df

   col1  col2
0    10    20
1   301    40
2    10    20
3    10    40
4    10    20
5    30    40
6  1000    40

In [54]:
# drop()
df.drop(columns='col1')

   col2
0    20
1    40
2    20
3    40
4    20
5    40
6    40